config.org
** Enhancements

Using ~dired-sidebar~ to conveniently go through files and folders in vertical minibuffer
#+begin_src emacs-lisp
;; this was taken from https://www.emacswiki.org/emacs/DiredOmitMode
(defun dired-dotfiles-toggle ()
  "Show/hide dot-files"
  (interactive)
  (when (equal major-mode 'dired-sidebar-mode)
    (if (or (not (boundp 'dired-dotfiles-show-p)) dired-dotfiles-show-p) ; if currently showing
        (progn 
          (set (make-local-variable 'dired-dotfiles-show-p) nil)
          (message "h")
          (dired-mark-files-regexp "^\\\.")
          (dired-do-kill-lines))
      (progn (revert-buffer) ; otherwise just revert to re-show
             (set (make-local-variable 'dired-dotfiles-show-p) t)))))

;; add dired-sidebar selector
(defun ibuffer-mark-dired-sidebar-buffers ()
  "Mark all `dired-sidebar' buffers."
  (interactive)
  (ibuffer-mark-on-buffer
   (lambda (buf) (eq (buffer-local-value 'major-mode buf) 'dired-sidebar-mode))))

;; for better quality icons, Emacs should be installed with imagemagick support
(use-package vscode-icon
  :straight t
  :commands (vscode-icon-for-file))

(use-package dired-sidebar
  :straight (:type git :host github :repo "jojojames/dired-sidebar")
  :bind (("C-x C-n" . dired-sidebar-toggle-sidebar)
         :map dired-mode-map
         ("<backtab>" . dired-dotfiles-toggle))
  :commands (dired-sidebar-toggle-sidebar)
  :init
  (add-hook 'dired-sidebar-mode-hook
            (lambda ()
              (unless (file-remote-p default-directory)
                (auto-revert-mode))))
  :config
  (push 'toggle-window-split dired-sidebar-toggle-hidden-commands)
  (push 'rotate-windows dired-sidebar-toggle-hidden-commands)
  (setq dired-sidebar-subtree-line-prefix "__")
  (setq dired-sidebar-theme 'vscode)
  (setq dired-sidebar-use-term-integration t))

(use-package ibuffer
  :straight (:type built-in)
  :config
  ;; define keymap to select all dired-sidebar modes while in ibuffer
  (define-key ibuffer-mode-map (kbd "* |") 'ibuffer-mark-dired-sidebar-buffers))

#+end_src

In terms of code folding we will use Emacs' =outline-minor-mode=, which is the same mechanism used in org-mode. 
#+begin_src emacs-lisp
;; ;; define custom function to trigger show/hide in 'outline-minor-mode'
(defun de/hide_all ()
  (interactive)
  (if outline-minor-mode
      (progn (outline-hide-body)
             (outline-hide-sublevels 1))
    (message "Outline minor mode is not enabled.")))

(add-hook 'prog-mode-hook 'outline-minor-mode)

;; remap some of the terrible default keybindings
(let ((kmap outline-minor-mode-map))
  (define-key kmap (kbd "M-<up>") 'outline-move-subtree-up)
  (define-key kmap (kbd "M-<down>") 'outline-move-subtree-down)
  (define-key kmap (kbd "<backtab>") 'outline-cycle)
  (define-key kmap (kbd "C-s-h") 'de/hide_all)
  (define-key kmap (kbd "C-s-s") 'outline-show-all))

#+end_src

** Navigation

I seldom use =C-v= or =M-v= to move page-by-page. So here I rebind these keybindings to custom functions that scrolls half-page up/down & keep things in the center for easier viewing:
#+begin_src emacs-lisp
(defun de/scroll-half-page-down ()
  (interactive)
  (move-to-window-line-top-bottom)
  (move-to-window-line-top-bottom)
  (recenter-top-bottom))

(defun de/scroll-half-page-up ()
  (interactive)
  (move-to-window-line-top-bottom)
  (recenter-top-bottom)
  (recenter-top-bottom))

(global-set-key (kbd "C-v") 'de/scroll-half-page-down)
(global-set-key (kbd "M-v") 'de/scroll-half-page-up)
#+end_src


* Programming setup

Setup ~treesitter~ for several languages. To tell whether the current buffer is using the ~ts~ mode is by running =M-x major-mode=.

#+begin_src emacs-lisp
(setq treesit-language-source-alist
      '((bash "https://github.com/tree-sitter/tree-sitter-bash")
  	(c "https://github.com/tree-sitter/tree-sitter-c")
  	(cmake "https://github.com/uyha/tree-sitter-cmake")
  	(css "https://github.com/tree-sitter/tree-sitter-css")
  	(elisp "https://github.com/Wilfred/tree-sitter-elisp")
  	(html "https://github.com/tree-sitter/tree-sitter-html")
  	(javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
  	(json "https://github.com/tree-sitter/tree-sitter-json")
  	(make "https://github.com/alemuller/tree-sitter-make")
  	(markdown "https://github.com/ikatyang/tree-sitter-markdown")
  	(python "https://github.com/tree-sitter/tree-sitter-python")
  	(toml "https://github.com/tree-sitter/tree-sitter-toml")
  	(yaml "https://github.com/ikatyang/tree-sitter-yaml")))
#+end_src

Silence eglot progress (in the *Messages* buffer)
#+begin_src emacs-lisp
(setq eglot-report-progress nil)
#+end_src

I have ~emacs-lsp-booster~ installed and setup in my ~PATH~, so I'd like to speed up LSP via ~eglot-booster~.

#+begin_src emacs-lisp
(use-package eglot
  :straight (:type built-in)
  :defer t
  :bind (:map eglot-mode-map
  	      ("C-c C-d" . eldoc)
  	      ("C-c C-f" . eglot-format-buffer))
  :hook ((python-base-mode . eglot-ensure)
  	 (python-base-mode . hs-minor-mode))
  :custom (eglot-autoshutdown t))

(use-package eglot-booster
  :defer t
  :straight (eglot-booster :type git :host github :repo "jdtsmith/eglot-booster")
  :after eglot
  :config (eglot-booster-mode))
#+end_src

Trying combobulate again...this time also using ~avy~ to move around magically. Use ~avy~ via keybinding =C-:=. Combobulate is turned on via =M-h= while in programming mode.

#+begin_src emacs-lisp
(use-package treesit
  :mode (("\\.py\\'" . python-ts-mode)
  	 ("\\.c\\'" . c-ts-mode)
  	 ("\\.yaml\\'" . yaml-ts-mode)
  	 ("\\.h\\'" . c-ts-mode))
  :straight (:type built-in))

(use-package 
  avy
  :straight t)

(global-set-key (kbd "C-:") 'avy-goto-char)
#+end_src

For general code formatting I use ~apheleia~. Python code formatting uses =ruff= installed via homebrew. Doing so will obviate installing a formatter for every Python environment.

#+begin_src emacs-lisp
(use-package apheleia
  :straight t
  :config
  ;; customize ruff
  (setf (alist-get 'ruff apheleia-formatters)
        '("ruff" "format" "--silent"
  	  "--line-length" "79"
  	  "--stdin-filename" filepath "-"))

  (setf (alist-get 'python-ts-mode apheleia-mode-alist)
        '(ruff-isort ruff))

  :hook (prog-mode . apheleia-mode)
  )

(require 'apheleia)
#+end_src

Use ~corfu~ for autocompletion. You can use multiple words to filter your search by using a separator, which is bound to the key =M-<space>= when a pop-up box is on the screen. Sometimes the partial match can get in the way of doing things, like choosing to rename your file to something else that is a sub/superset of the string. Do =M-<enter>= to enter the literal entry, rather than the match.

#+begin_src emacs-lisp
(use-package corfu
  :straight t
  :custom
  (tab-always-indent 'complete)
  (completion-cycle-threshold nil)
  (corfu-cycle t) ;; allow cycling through candidates
  (corfu-auto t) ;; enable auto completion
  (corfu-quit-no-match 'separator) ;; or t
  (corfu-auto-delay 0.1)
  (corfu-echo-documentation nil)
  (corfu-popupinfo-delay '(0.3 . 0.15))
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode))

;; add corfu extension
(use-package cape
  :straight t
  :bind (("C-c p p" . completion-at-point)
  	 ("C-c p \\" . cape-tex)
  	 ("C-c p _" . cape-tex)
  	 ("C-c p ^" . cape-tex)
  	 ("C-c p f" . cape-file)
  	 ("C-c p d" . cape-dabbrev)
  	 ("C-c p s" . cape-elisp-symbol)
  	 ("C-c p e" . cape-elisp-block))
  :init
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-elisp-block))
#+end_src

