config.el
(use-package python
  :config
  (define-key python-ts-mode-map (kbd "s-[") 'python-indent-shift-left)
  (define-key python-ts-mode-map (kbd "s-]") 'python-indent-shift-right)
  )

(use-package micromamba
  :straight t
  :config
  (defun change-inferior-python ()
    (when (executable-find "ipython3")
      (setq python-shell-interpreter "ipython3"
    	    python-shell-interpreter-args "--simple-prompt")))
  :hook
  (micromamba-postactivate-hook . change-inferior-python)
  )

;; set 'utils' to be the default Python environment
(when (functionp 'micromamba-activate)
  (micromamba-activate "utils"))

(defun de/restart-python ()
  "Clear current inferior python buffer and restart process"
  (interactive)
  (progn (with-current-buffer "*Python*" (comint-clear-buffer))
	 (python-shell-restart)))

;; custom function to kill current cell
(defun de/kill-cell ()
  "code-cells mode custom function to kill current cell"
  (interactive)
  (let ((beg (car (code-cells--bounds)))
	(end (cadr (code-cells--bounds))))
    (kill-region beg end)))

(use-package code-cells
  :straight t
  :defer t
  :hook ((python-ts-mode . code-cells-mode-maybe))
  :config
  (add-to-list 'code-cells-eval-region-commands
	       '(python-ts-mode . python-shell-send-region) t)
  :bind
  (:map
   code-cells-mode-map
   ("M-p" . code-cells-backward-cell)
   ("M-n" . code-cells-forward-cell)
   ("C-c r p" . de/restart-python)
   ("C-c d d" . de/kill-cell)
   ("M-S-<up>" . code-cells-move-cell-up)
   ("M-S-<down>" . code-cells-move-cell-down)
   ("C-c x ;" . code-cells-comment-or-uncomment)
   ("C-c C-c" . code-cells-eval)))

(use-package jupyter
  :straight t (jupyter :type git :host github :repo "emacs-jupyter/jupyter")
  :defer t
  :custom
  ;; (jupyter-eval-use-overlays t)
  (jupyter-repl-echo-eval-p t)
  :bind
  (:map jupyter-repl-mode-map
	("C-c C-k" . jupyter-repl-clear-cells)))

(use-package gnuplot
  :defer t
  :straight t)

;; enable languages for org-babel
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (awk . t)
   (sed . t)
   (shell . t)
   (gnuplot . t)
   (python . t)
   (jupyter . t)))

(org-babel-jupyter-override-src-block "python")

;; patch for correct handling of 'python' org source blocks
(add-to-list 'org-src-lang-modes '("python" . python-ts))

(defun de/insert-org-jupyter-kernel-spec ()
  "Interactively insert a Jupyter kernel spec at the beginning of an Org document.
Ensure 'jupyter' is available, or interactively activate it using 'micromamba-activate'."
  (interactive)
  (unless (executable-find "jupyter")
    (call-interactively 'micromamba-activate)) ;; Call `micromamba-activate` interactively to ensure prompt.
  ;; Ensure 'jupyter' is available after activation attempt.
  (if (executable-find "jupyter")
      (let* ((kernelspec (jupyter-completing-read-kernelspec))
             (kernel-name (jupyter-kernelspec-name kernelspec))
             (kernel-display-name (plist-get (jupyter-kernelspec-plist kernelspec) :display_name))
             (insertion-point (point-min))
             (properties (format "#+PROPERTY: header-args:python :session py
#+PROPERTY: header-args:python+ :async yes
#+PROPERTY: header-args:python+ :eval never-export
#+PROPERTY: header-args:python+ :kernel %s\n"  kernel-name)))
        (save-excursion
          (goto-char insertion-point)
          (insert properties)
          (message "Inserted Jupyter kernel spec for '%s'." kernel-display-name)))
    (message "Jupyter is not available. Please ensure it is installed and try again.")))

(defun de/org-jupyter-setup ()
  (define-key org-mode-map (kbd "C-c j") 'de/insert-org-jupyter-kernel-spec))

(add-hook 'org-mode-hook 'de/org-jupyter-setup())

(defun patch/display-ansi-colors ()
  "Fixes kernel output in emacs-jupyter"
  (ansi-color-apply-on-region (point-min) (point-max)))
(add-hook 'org-mode-hook
	  (lambda ()
	    (add-hook 'org-babel-after-execute-hook #'patch/display-ansi-colors)))

(defun de/python-with-jupyter-repl
    (kernel-name &optional repl-name filename)
  "Choose jupyter kernel to open/start new Python file associated to it
"
  ;; ~interactive~ form only constructs a list of elements that
  ;; correspond directly to the arguments of the function
  (interactive
   (let ((file (read-file-name "Open Python file: " nil nil nil)))
     (list
      ;; first argument, kernel-name
      (jupyter-kernelspec-name
       (jupyter-completing-read-kernelspec nil current-prefix-arg))
      ;; second argument, repl-name
      (if current-prefix-arg ;; if user supplies REPL name, use it
	  (read-string "REPL name: ")
	(file-name-base file)) ;; otherwise, use base filename
      ;; third argument, filename
      file)))
  
  ;; this means you can interactively choose what gets passed as the
  ;; arguments for the function

  ;; open or create the Python file
  (find-file filename)

  ;; start the jupyter REPL and store the client symbol
  (let ((client (jupyter-run-repl kernel-name repl-name)))
    ;; wait for REPL to start and then associate the buffer
    (sleep-for 1.0)
    (jupyter-repl-associate-buffer client)))

(use-package nano-theme
  :straight (nano-theme :type git :host github :repo "rougier/nano-theme"))

;; setup customization of nano colors via advice
(defun de/customize-nano-themes ()
  (set-face-attribute 'show-paren-match nil :background "#96ddcf"))

(defun de/advise-nano-themes ()
  "Add advice to nano theme functions to set show-paren-match face."
  (advice-add 'nano-dark :after #'de/customize-nano-themes)
  (advice-add 'nano-light :after #'de/customize-nano-themes))

(de/advise-nano-themes)


(require 'nano-theme)
(nano-mode)

;; use the 'light scheme by default, switch by calling `nano-theme-toggle`
(load-theme 'nano t)

(use-package nano-modeline
  :straight (nano-modeline :type git :host github :repo "rougier/nano-modeline")
  :hook
  (text-mode-hook nano-modeline-text-mode)
  (prog-mode-hook nano-modeline-prog-mode)
  (org-mode-hook nano-modeline-org-mode))

;; set nano-modeline as default
(require 'nano-modeline)
(nano-modeline-text-mode t)

;; hide the default modeline
(setq-default mode-line-format nil)

;; set customization on emacs startup
(add-hook 'emacs-startup-hook #'de/customize-nano-themes)

;; call these after init to avoid orderof-execution problems
(add-hook 'after-init-hook
          (lambda ()
            (menu-bar-mode -1)
            (tool-bar-mode -1)
            (scroll-bar-mode -1)))

;; Set default frame size
(add-to-list 'default-frame-alist '(width . 80))
(add-to-list 'default-frame-alist '(height . 30))

(use-package rainbow-mode
  :straight t
  :hook (org-mode prog-mode))
