config.org
* Org-capture setup

In the templates here's what each placeholder means:
~%?~ is where the cursor will be placed for you to start typing
~%i~ is the initial content
~%a~ is an automatic link to the location where you initiated the capture
~%U~ inserts a timestamp
~%T~ prompts you date and time. Simply enter the date first and click on the desired date in the minibuffer

To prompt for the entry in the minibuffer. use ~%^{prompt}~.
Enter time in a 24-hour format.

You can add priorities to each TODO or notes by adding a =[#1]= (a numeric value to each tag). For example:  =* TODO [#1] my TODO item.= 
Generally, the notes are meant to be refiled so that it would show up when you run =M-x notes-list=. However, the TODO items get added to the calendar.

#+begin_src emacs-lisp
;; set =C-c c= to do org-capture
(define-key global-map (kbd "C-c c") 'org-capture)

;; set templates
(setq org-capture-templates
      '(("t" "TODO" entry (file+headline "~/Documents/org/tasks.org" "Tasks")
    	 "* TODO %U %? \n  %i\n")
  	("n" "Note" entry (file+headline "~/Documents/org/notes.org" "Notes")
  	 "* %^{TITLE} :NOTE:\n#+DATE: %<%Y-%m-%d %a>\n#+FILETAGS: note\n#+SUMMARY: %^{SUMMARY}\n#+ICON: material/notebook\n%?\n")
  	("m" "Meeting" entry (file+headline "~/Documents/org/meetings.org" "Meetings")
  	 "* Meeting with %? :MEETING:\nSCHEDULED: %^T\n-  Location: %^{Location}\n-  Participants: %^{Participants}\n- Agenda:\n  -  %^{Agenda}\n")
  	("e" "Event" entry (file+headline "~/Documents/org/events.org" "Events" )
  	 "* %? :EVENT:\nSCHEDULED: %^T\n-  Location: %^{Location}\n-  %i\n")))

;; configure refile targets
(setq org-refile-targets '((nil :maxlevel . 3)
  			   (org-agenda-files :maxlevel . 3)))
#+end_src

The workflow is such: do =C-c n= to capture a note in a new buffer, then save the file and do =C-c C-c= to complete the capture. Do =C-c C-k= to abort capture.

To refile the captured notes and todo lists, do =C-c C-w=, entries can be refiled to files listed in ~org-agenda-files~.


* Miscellaneous support

I use OpenSCAD for 3D printing, so editing the files in Emacs is nice
#+begin_src emacs-lisp
(use-package scad-mode
  :defer t
  :straight (scad-mode :type git :host github :repo "openscad/emacs-scad-mode"))
#+end_src

Sometimes I work with a lot of CSV files when doing data processing using Python
#+begin_src emacs-lisp
(use-package csv-mode
  :defer t
  :straight (csv-mode :type git :host github :repo "emacsmirror/csv-mode"))
#+end_src

** LLM in Emacs

#+begin_src emacs-lisp
(use-package ellama
  :init
  (setopt ellama-keymap-prefix "C-c e")
  (require 'llm-ollama)
  (setopt ellama-provider
  	  (make-llm-ollama
  	   :chat-model "llama3:instruct"
  	   :embedding-model "llama3:latest")))

#+end_src
